START_MESSAGE = """
سلام به ربات تلگرامی رهگیری مرسولات پستی شرکت ملی پست ایران خوش آمدید.
برای رهگیری بسته پستی خود، لطفا کد رهگیری تان را ارسال نمایید.
"""


INVALID_CODE = """
کد رهگیری ارسال شده نامعتبر است ، لطفا کد رهگیری 24 رقمی را با ارقام انگلیسی بدون هیچی عبارت اضافی ارسال کنید !
"""

TRACKING_NOT_FOUND = """
اطلاعاتی درباره کد رهگیری ارسال شده وجود ندارد.
"""

UNHANDLED_ERROR = """
خطایی غیر منتظره رخ داد ، لطفا مدتی بعد امتحان کنید.
در صورت تکرار ، به سازنده گزارش دهید.
"""

TRACKING_STATUS = """
📆 تاریخ : {date}
⏰زمان : {time}
🏣 موقعیت : {location}
📮وضعیت : {status}
"""
