START_MESSAGE = """
سلام به ربات تلگرامی رهگیری مرسولات پستی شرکت ملی پست ایران خوش آمدید.
برای رهگیری بسته پستی خود، لطفا کد رهگیری تان را ارسال نمایید.
"""


INVALID_CODE = """
کد رهگیری ارسال شده نامعتبر است ، لطفا کد رهگیری را با ارقام انگلیسی بدون هیچ عبارت اضافه ای ارسال کنید !
"""

TRACKING_NOT_FOUND = """
اطلاعاتی درباره کد رهگیری ارسال شده وجود ندارد.
"""

UNHANDLED_ERROR = """
خطایی غیر منتظره رخ داد ، لطفا مدتی بعد امتحان کنید.
در صورت تکرار ، به سازندگان [گزارش](https://github.com/AmirAref/post-tracker-bot/issues) دهید.
"""

TRACKING_STATUS = """
📆 تاریخ : {date}
⏰ زمان : {time}
🏣 موقعیت : {location}
📮 وضعیت : {status}
"""

ALERT_UPDATE_SUCCESS = """
✅ آخرین وضعیت مرسوله با موفقیت دریافت شد
"""

ALERT_UPDATE_ERROR = """
❌ مشکلی در به روز رسانی به وجود آمده است
"""


ALERT_UPDATE_NOT_MODIFIED = """
ℹ️ آخرین وضعیت مرسوله تغییری نکرده است
"""

UPDATE_BUTTON_TEXT = "🔄 به‌روزرسانی"
